<style>
    #introduction {
        float: right;
        width: 100%;
        background: #fff;
        box-shadow: 0 1px 3px #eee;
        border-radius: 4px;
        overflow: hidden;
        margin-top: 20px;
        height: 200px;
        position: relative;
        font-family: "2  Homa";
    }

    #introduction .more {
        display: block;
        position: absolute;
        text-align: center;
        font-size: 14pt;
        font-family: "2  Homa";
        width: 100%;
        cursor: pointer;
        bottom: 0;
    }

    #introduction .fewer {
        display: block;
        text-align: center;
        font-size: 14pt;
        font-family: "2  Homa";
        width: 100%;
        cursor: pointer;
    }

    #introduction.active {
        height: auto !important;
    }
</style>
<div id="introduction">
    <div style="margin-bottom: 10px">
        <p style="font-size: 15pt;padding: 10px">معرفی اجمالی محصول</p>
        <p style="font-family: '2  Homa';padding: 10px">
            <!--        --><? //= $productInfo['introduction']; ?>
            گوشی « Mi Note 10» از سری محصولات شرکت مطرح شیائومی است که با پنل­ آمولد ساخته‌شده و فاصله لبه صفحه‌نمایش در
            آن بسیار کم است. نمایشگر Mi Note 10 از رزولوشن بالایی برخوردار است ؛ به‌طوری‌که در اندازه‌ی 6.47 اینچی آن،
            حدود 398 پیکسل را در هر اینچ جا داده است. در گوشی نوت 10 شیائومی نمایشگر تقریباً تمام قاب جلویی گوشی را پر
            کرده است. این مشخصه در کنار فریم تهیه شده از آلومینیوم قرار گرفته است که ظاهر زیبایی روشی « Mi Note 10» از
            سری محصولات شرکت مطرح شیائومی است که با پنل­ آمولد ساخته‌شده و فاصله لبه صفحه‌نمایش در آن بسیار کم است.
            نمایشگر Mi Note 10 از رزولوشن بالایی برخوردار است ؛ به‌طوری‌که در اندازه‌ی 6.47 اینچی آن، حدود 398 پیکسل را
            در هر اینچ جا داده است. در گوشی نوت 10 شیائومی نمایشگر تقریباً تمام قاب جلویی گوشی را پر کرده است. این مشخصه
            در کنار فریم تهیه شده از آلومینیوم قرار گرفته است که ظاهر زیبایی روشی « Mi Note 10» از سری محصولات شرکت مطرح
            شیائومی است که با پنل­ آمولد ساخته‌شده و فاصله لبه صفحه‌نمایش در آن بسیار کم است. نمایشگر Mi Note 10 از
            رزولوشن بالایی برخوردار است ؛ به‌طوری‌که در اندازه‌ی 6.47 اینچی آن، حدود 398 پیکسل را در هر اینچ جا داده
            است. در گوشی نوت 10 شیائومی نمایشگر تقریباً تمام قاب جلویی گوشی را پر کرده است. این مشخصه در کنار فریم تهیه
            شده از آلومینیوم قرار گرفته است که ظاهر زیبایی روشی « Mi Note 10» از سری محصولات شرکت مطرح شیائومی است که با
            پنل­ آمولد ساخته‌شده و فاصله لبه صفحه‌نمایش در آن بسیار کم است. نمایشگر Mi Note 10 از رزولوشن بالایی
            برخوردار است ؛ به‌طوری‌که در اندازه‌ی 6.47 اینچی آن، حدود 398 پیکسل را در هر اینچ جا داده است. در گوشی نوت
            10 شیائومی نمایشگر تقریباً تمام قاب جلویی گوشی را پر کرده است. این مشخصه در کنار فریم تهیه شده از آلومینیوم
            قرار گرفته است که ظاهر زیبایی روشی « Mi Note 10» از سری محصولات شرکت مطرح شیائومی است که با پنل­ آمولد
            ساخته‌شده و فاصله لبه صفحه‌نمایش در آن بسیار کم است. نمایشگر Mi Note 10 از رزولوشن بالایی برخوردار است ؛
            به‌طوری‌که در اندازه‌ی 6.47 اینچی آن، حدود 398 پیکسل را در هر اینچ جا داده است. در گوشی نوت 10 شیائومی
            نمایشگر تقریباً تمام قاب جلویی گوشی را پر کرده است. این مشخصه در کنار فریم تهیه شده از آلومینیوم قرار گرفته
            است که ظاهر زیبایی روشی « Mi Note 10» از سری محصولات شرکت مطرح شیائومی است که با پنل­ آمولد ساخته‌شده و
            فاصله لبه صفحه‌نمایش در آن بسیار کم است. نمایشگر Mi Note 10 از رزولوشن بالایی برخوردار است ؛ به‌طوری‌که در
            اندازه‌ی 6.47 اینچی آن، حدود 398 پیکسل را در هر اینچ جا داده است. در گوشی نوت 10 شیائومی نمایشگر تقریباً
            تمام قاب جلویی گوشی را پر کرده است. این مشخصه در کنار فریم تهیه شده از آلومینیوم قرار گرفته است که ظاهر
            زیبایی روشی « Mi Note 10» از سری محصولات شرکت مطرح شیائومی است که با پنل­ آمولد ساخته‌شده و فاصله لبه
            صفحه‌نمایش در آن بسیار کم است. نمایشگر Mi Note 10 از رزولوشن بالایی برخوردار است ؛ به‌طوری‌که در اندازه‌ی
            6.47 اینچی آن، حدود 398 پیکسل را در هر اینچ جا داده است. در گوشی نوت 10 شیائومی نمایشگر تقریباً تمام قاب
            جلویی گوشی را پر کرده است. این مشخصه در کنار فریم تهیه شده از آلومینیوم قرار گرفته است که ظاهر زیبایی ر
        </p>

    </div>

<div style="padding: 20px;float: right;width: 100%;">
    <a class="more" style="bottom: 0">نمایش بیشتر...</a>
    <a class="fewer" style="display: none">نمایش کمتر</a>
</div>

</div>


<script>


    $('#introduction .more').click(function () {
        $('#introduction').toggleClass('active');
        $(this).fadeOut(0);
        $('#introduction .fewer').fadeIn(0);
    });
    $('#introduction .fewer').click(function () {
        $('#introduction').removeClass('active');
        $(this).fadeOut(0);
        $('#introduction .more').fadeIn(0);
    });


</script>